---
kind: method
id: M:Autodesk.Revit.DB.View3D.RestoreOrientationAndLock
zh: 三维视图、3d视图
source: html/d77a9236-3429-0b1a-66b7-3bcd0d8e2854.htm
---
# Autodesk.Revit.DB.View3D.RestoreOrientationAndLock Method

**中文**: 三维视图、3d视图

Locks the view and restores its orientation.

## Syntax (C#)
```csharp
public void RestoreOrientationAndLock()
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - View has never been locked.